# ConnectionInputPointInfo Properties

---
The ConnectionInputPointInfo type exposes the following members.
| Name| Description
---|---|---
| InputMemberIndex|  A index of the input member to which the restriction applies.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| PointSelectionText|  A string used to select input point by some connections.
| RestrictionType|  A type of input point restriction.
Top
#### Reference
ConnectionInputPointInfo Class
Autodesk.Revit.DB.Structure Namespace